cask_args appdir: "/Applications"

# ensure everything installed afterwards can depend on recent version of readline and openssl
brew "readline"
brew "openssl"

# python
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "python3"

# node
brew "nodejs"
brew "yarn"
brew "npm"

# a more recent version of java than the default
cask "java"

# git tools
brew "git"
brew "tig" # browse & work interactively with git repos from the commandline
cask "sourcetree" # git UI

# zsh shell, better shell and commandline experience
cask "iterm2" # best terminal app on mac
brew "zsh"
brew "zsh-completion"
brew "zsh-autosuggestions"

# fast & accurate command line search
brew "fzf" # fuzzy finder
brew "ripgrep"

brew "shellcheck" # linter for shell scripts
brew "ssh-copy-id" # copy ssh keys to remote servers
brew "tree"
brew "watch"
brew "tmux"

# http clients
brew "wget"
brew "curl"
brew "wrk" # http benchmark tool a la apache bench (ab)

# browsers
cask "google-chrome"
cask "firefox"

# chat/communication
cask "slack"
cask "microsoft-teams"

# developer editors
cask "atom" # atom editor from github
cask "visual-studio-code"

# developer tools
cask "docker" # docker4mac for working with images & containers
brew "nmap" # check for open ports
cask "charles" # developer proxy that shows you all http/https traffic
cask "wireshark" # analyze network traffic
cask "postman" # developer tool for API's
cask "kaleidoscope" # great file diff UI
cask "devdocs" # devdocs.io desktop client for developer documentation a la Dash

# random tools
tap aws/tap
cask "awscli" # AWS CLI
cask "aws-sam-cli" # SAM CLI
cask "spectacle" # window management
cask "imageoptim" # optimize image size file per drag'n'drop
cask "kap" # capture screen as video
cask "flycut" # clipboard manager
cask "the-unarchiver" # extract all kinds of file archives
cask "licecap" # record screen video as gif
cask "caffeine" # do not let your mac fall asleep
cask "cheatsheet" # show shortcuts of current app
cask "karabiner-elements" # manage keyboard shortcuts/bindings
